docs/leets/0338-Counting-Bits.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-22 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0338. Counting Bits</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-05-17
</div>
<div id="content" class="content">
<header>
<h1 class="title">0338. Counting Bits</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf55a48b">Problem Overview</a></li>
<li><a href="#orgff22c8b">Solution Outline</a></li>
<li><a href="#orge63b957">Implementation Plan</a></li>
<li><a href="#org5d264a3">Solution Analysis</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgf55a48b" class="outline-2">
<h2 id="orgf55a48b">Problem Overview</h2>
<div class="outline-text-2" id="text-orgf55a48b">
<p>
The problem "Counting Bits" requires us to return an array `ans` where `ans[i]` is the number of 1's in the binary representation of the number `i` for all `i` in the range 0 to `n` inclusive.
</p>

<p>
Key Points:
</p>
<ul class="org-ul">
<li>We need to count the number of 1's in the binary representation of numbers from 0 to `n`.</li>
<li>The result should be stored in an array.</li>
</ul>
</div>
</div>

<div id="outline-container-orgff22c8b" class="outline-2">
<h2 id="orgff22c8b">Solution Outline</h2>
<div class="outline-text-2" id="text-orgff22c8b">
<ol class="org-ol">
<li><b><b>Preferred Structure:</b></b> 
<ul class="org-ul">
<li>Use an array to store the count of 1's for each number from 0 to `n`.</li>
</ul></li>
<li><b><b>Brute Force vs Optimal Solution:</b></b>
<ul class="org-ul">
<li><b><b>Brute Force:</b></b> For each number, convert it to its binary form and count the 1's. This would be inefficient.</li>
<li><b><b>Optimal Solution:</b></b> Utilize a dynamic programming approach where the count of 1's for a number can be derived from previously computed results. Specifically, use the relation: `countBits[i] = countBits[i &gt;&gt; 1] + (i &amp; 1)`.</li>
</ul></li>
<li><b><b>Algorithm Choice:</b></b>
<ul class="org-ul">
<li>Dynamic Programming: This approach leverages previously computed results to build up the solution efficiently.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge63b957" class="outline-2">
<h2 id="orge63b957">Implementation Plan</h2>
<div class="outline-text-2" id="text-orge63b957">
<ol class="org-ol">
<li>Initialize an array `result` of length `n + 1` with all elements set to 0.</li>
<li>Iterate from 1 to `n`, updating each entry based on the relation `result[i] = result[i &gt;&gt; 1] + (i &amp; 1)`.</li>
</ol>

<div class="org-src-container">
<pre class="src src-js">/**
 * Function to count the number of 1's in the binary representation of numbers from 0 to n.
 * @param {number} n - The upper limit of the range.
 * @returns {number[]} - Array where the ith element is the number of 1's in the binary representation of i.
 */
function countBits(n) {
    // Initialize the result array with zeros
    const result = Array(n + 1).fill(0);

    for (let i = 0; i &lt; result.length; i++) {
        let el = i;
        let cnt = el &amp; 1;
        el = el &gt;&gt; 1;

        while (el &gt; 0) {
            cnt += el &amp; 1;
            el = el &gt;&gt; 1;
        }
        result[i] = cnt;

    }
    return result;
}

// Test cases
const testCases = [
    { n: 2, expected: [0, 1, 1] },
    { n: 5, expected: [0, 1, 1, 2, 1, 2] },
    // Additional test cases
    { n: 0, expected: [0] },
    { n: 1, expected: [0, 1] },
    { n: 10, expected: [0, 1, 1, 2, 1, 2, 2, 3, 1, 2, 2] },
];

testCases.forEach((test, index) =&gt; {
    const result = countBits(test.n);
    console.log(`Test Case ${index + 1}: ${JSON.stringify(result) === JSON.stringify(test.expected) ? 'Passed' : 'Failed'} (Expected: ${JSON.stringify(test.expected)}, Got: ${JSON.stringify(result)})`);
});
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d264a3" class="outline-2">
<h2 id="org5d264a3">Solution Analysis</h2>
<div class="outline-text-2" id="text-org5d264a3">
<ul class="org-ul">
<li><b><b>Time Complexity:</b></b> O(n). Each number from 0 to `n` is processed exactly once.</li>
<li><b><b>Space Complexity:</b></b> O(n). We use an array of size `n + 1` to store the result.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
